In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\rajp6\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rajp6\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rajp6\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rajp6\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rajp6\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\rajp6\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [7]:
import pandas as pd
series1 = pd.Series([10,20,30])
print(series1)

0    10
1    20
2    30
dtype: int64

In [17]:
series2 = pd.Series((['kavi','shyam','ravi']),index =[3,5,1])
print(series2)

3     kavi
5    shyam
1     ravi
dtype: object

In [3]:
import numpy as np
import pandas as pd
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int32

In [21]:
series4 = pd.Series(array1,index=['jan','feb','mar','apr'])
print(series4)

jan    1
feb    2
mar    3
apr    4
dtype: int32

In [23]:
dict1 = {'india': 'newdelhi','uk':
         'london','japan':'tokyo'}
print(dict1)

{'india': 'newdelhi', 'uk': 'london', 'japan': 'tokyo'}

In [25]:
series8 = pd.Series(dict1)
print(series8)

india    newdelhi
uk         london
japan       tokyo
dtype: object

In [29]:
seriesmnths = pd.Series([2,3,4],index = ['feb','mar','apr'])
seriesmnths['mar']

3

In [31]:
seriescapcou = pd.Series(['newdeldi','washingtondc','london','paris'],index=['india','usa','uk','france'])
seriescapcou

india         newdeldi
usa       washingtondc
uk              london
france           paris
dtype: object

In [33]:
seriescapcou[1:3]

usa    washingtondc
uk           london
dtype: object

In [3]:
#method of series
import numpy as np
import pandas as pd
seriesTenTwenty=pd.Series(np.arange(10,20,1))
print(seriesTenTwenty)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [11]:
seriesTenTwenty.head(2)

0    10
1    11
dtype: int32

In [13]:
seriesTenTwenty.count()

10

In [15]:
seriesTenTwenty.tail(2)

8    18
9    19
dtype: int32

In [17]:
seriesA =pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
seriesB = pd.Series([10,20,-10,-50,-100],
index = ['z','y','a','c','e'])
seriesB

z     10
y     20
a    -10
c    -50
e   -100
dtype: int64

In [21]:
seriesA + seriesB

a    -9.0
b     NaN
c   -47.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [25]:
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30,-40])
dFrame4 = pd.DataFrame(array1)
dFrame4

    0
0  10
1  20
2  30

In [29]:
listDict = [{'a':10,"b":20},{'a':5,'b':10,'c':20}]
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [31]:
seriesA = pd.Series([1,2,3,4,5],index =['a','b','c','d','e'])
seriesB = pd.Series([1000,2000,-1000,-5000,1000],index = ['a','b','c','d','e'])
seriesC = pd.Series([10,20,-10,-50,100],index = ['z','y','a','c','e'])

dFrame6 = pd.DataFrame(seriesA)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [33]:
dFrame7 = pd.DataFrame([seriesA,seriesB])
dFrame7

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  1000

In [3]:
ResultSheet = {'Aranab':pd.Series([90,91,97],index = ['maths','science','hindi']),
'Ramit':pd.Series([92,81,96],index = ['maths','science','hindi']),
'sahir':pd.Series([89,91,88],index = ['maths','science','hindi']),
'riya':pd.Series([81,71,68],index = ['maths','science','hindi']),
'mallik':pd.Series([79,81,78],index = ['maths','science','hindi'])}
ResultDf = pd.DataFrame(ResultSheet)
ResultDf

         Aranab  Ramit  sahir  riya  mallik
maths        90     92     89    81      79
science      91     81     91    71      81
hindi        97     96     88    68      78

In [9]:
ResultDf["jimy"]=[89,78,76]
ResultDf

         Aranab  Ramit  sahir  riya  mallik  jimy
maths        90     92     89    81      79    89
science      91     81     91    71      81    78
hindi        97     96     88    68      78    76

In [11]:
ResultDf = ResultDf.drop('science',axis=0)
ResultDf

       Aranab  Ramit  sahir  riya  mallik  jimy
maths      90     92     89    81      79    89
hindi      97     96     88    68      78    76

In [15]:
ResultDf = ResultDf.drop(['Ramit','riya'],axis=1)
ResultDf

       Aranab  sahir  mallik  jimy
maths      90     89      79    89
hindi      97     88      78    76

In [27]:
ResultDf=ResultDf.rename({'maths':'sub1','english':'sub','hindi':'sub4'},axis='index')
ResultDf

      Aranab  sahir  mallik  jimy
sub1      90     89      79    89
sub4      97     88      78    76

In [35]:

ResultDf.loc['sub4']

Aranab    97
sahir     88
mallik    78
jimy      76
Name: sub4, dtype: int64

In [37]:
ResultDf.loc['sub1':'sub4']

      Aranab  sahir  mallik  jimy
sub1      90     89      79    89
sub4      97     88      78    76

In [9]:
import pandas as pd
df3=pd.read_csv('C:\\Users\\rajp6\\Downloads\\archive (2)\\Mall_Customers.csv')
df3

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [17]:
df4=pd.read_csv("C:\\Users\\rajp6\\Downloads\\supply_chain_data.csv")
df4

,Product type,SKU,Price,Availability,Number of products sold,Revenue generated,Customer demographics,Stock levels,Lead times,Order quantities,...,Location,Lead time,Production volumes,Manufacturing lead time,Manufacturing costs,Inspection results,Defect rates,Transportation modes,Routes,Costs
0,haircare,SKU0,69.808006,55,802,8661.996792,Non-binary,58,7,96,...,Mumbai,29,215,29,46.279879,Pending,0.226410,Road,Route B,187.752075
1,skincare,SKU1,14.843523,95,736,7460.900065,Female,53,30,37,...,Mumbai,23,517,30,33.616769,Pending,4.854068,Road,Route B,503.065579
2,haircare,SKU2,11.319683,34,8,9577.749626,Unknown,1,10,88,...,Mumbai,12,971,27,30.688019,Pending,4.580593,Air,Route C,141.920282
3,skincare,SKU3,61.163343,68,83,7766.836426,Non-binary,23,13,59,...,Kolkata,24,937,18,35.624741,Fail,4.746649,Rail,Route A,254.776159
4,skincare,SKU4,4.805496,26,871,2686.505152,Non-binary,5,3,56,...,Delhi,5,414,3,92.065161,Fail,3.145580,Air,Route A,923.440632
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,haircare,SKU95,77.903927,65,672,7386.363944,Unknown,15,14,26,...,Mumbai,18,450,26,58.890686,Pending,1.210882,Air,Route A,778.864241
96,cosmetics,SKU96,24.423131,29,324,7698.424766,Non-binary,67,2,32,...,Mumbai,28,648,28,17.803756,Pending,3.872048,Road,Route A,188.742141
97,haircare,SKU97,3.526111,56,62,4370.916580,Male,46,19,4,...,Mumbai,10,535,13,65.765156,Fail,3.376238,Road,Route A,540.132423
98,skincare,SKU98,19.754605,43,913,8525.952560,Female,53,1,27,...,Chennai,28,581,9,5.604691,Pending,2.908122,Rail,Route A,882.198864
99,haircare,SKU99,68.517833,17,627,9185.185829,Unknown,55,8,59,...,Chennai,29,921,2,38.072899,Fail,0.346027,Rail,Route B,210.743009

In [5]:
ResultDf.describe()

          Aranab      Ramit      sahir       riya     mallik
count   3.000000   3.000000   3.000000   3.000000   3.000000
mean   92.666667  89.666667  89.333333  73.333333  79.333333
std     3.785939   7.767453   1.527525   6.806859   1.527525
min    90.000000  81.000000  88.000000  68.000000  78.000000
25%    90.500000  86.500000  88.500000  69.500000  78.500000
50%    91.000000  92.000000  89.000000  71.000000  79.000000
75%    94.000000  94.000000  90.000000  76.000000  80.000000
max    97.000000  96.000000  91.000000  81.000000  81.000000

In [9]:
resulaf = {"prakhar":pd.Series([90,91,34],index =["math","k","c"]),
           "hhsd":pd.Series([9,9,34],index =["math","k","c"]),
           "njsns":pd.Series([90,91,34],index =["math","k","c"])}
ResultDf = pd.DataFrame(resulaf)
ResultDf

      prakhar  hhsd  njsns
math       90     9     90
k          91     9     91
c          34    34     34